In [1]:
import pandas as pd
import numpy as np
%config Completer.use_jedi = False

## Basic
---

In [2]:
dates = pd.date_range('20210101', periods=5)
data = pd.DataFrame(np.random.randn(5, 4), index=dates, columns=list('ABCD'))
data

                   A         B         C         D
2021-01-01 -0.005078  1.455872  2.031893  0.296660
2021-01-02  1.301898  0.492462  2.432947  0.296697
2021-01-03  0.910164  0.941490 -1.714418 -0.140108
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861
2021-01-05  1.416276  0.786483 -1.611496  0.547112

In [3]:
data['A']

2021-01-01   -0.005078
2021-01-02    1.301898
2021-01-03    0.910164
2021-01-04   -1.006512
2021-01-05    1.416276
Freq: D, Name: A, dtype: float64

In [4]:
data['A'][dates[0]]

-0.005077809479121174

In [5]:
data[['A', 'B']] = data[['B', 'A']]
data

                   A         B         C         D
2021-01-01  1.455872 -0.005078  2.031893  0.296660
2021-01-02  0.492462  1.301898  2.432947  0.296697
2021-01-03  0.941490  0.910164 -1.714418 -0.140108
2021-01-04 -1.637928 -1.006512 -1.643442  0.981861
2021-01-05  0.786483  1.416276 -1.611496  0.547112

In [6]:
#The correct way to swap column values is by using raw values:
print(data)
data.loc[:, ['B', 'A']] = data[['A', 'B']].to_numpy()
print(data)

                   A         B         C         D
2021-01-01  1.455872 -0.005078  2.031893  0.296660
2021-01-02  0.492462  1.301898  2.432947  0.296697
2021-01-03  0.941490  0.910164 -1.714418 -0.140108
2021-01-04 -1.637928 -1.006512 -1.643442  0.981861
2021-01-05  0.786483  1.416276 -1.611496  0.547112
                   A         B         C         D
2021-01-01 -0.005078  1.455872  2.031893  0.296660
2021-01-02  1.301898  0.492462  2.432947  0.296697
2021-01-03  0.910164  0.941490 -1.714418 -0.140108
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861
2021-01-05  1.416276  0.786483 -1.611496  0.547112

## Attribute access
___

In [7]:
data.A

2021-01-01   -0.005078
2021-01-02    1.301898
2021-01-03    0.910164
2021-01-04   -1.006512
2021-01-05    1.416276
Freq: D, Name: A, dtype: float64

In [8]:
# create a new column
data['E'] =  list(range(len(data.index)))
data

                   A         B         C         D  E
2021-01-01 -0.005078  1.455872  2.031893  0.296660  0
2021-01-02  1.301898  0.492462  2.432947  0.296697  1
2021-01-03  0.910164  0.941490 -1.714418 -0.140108  2
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861  3
2021-01-05  1.416276  0.786483 -1.611496  0.547112  4

## Slicing ranges
___

In [9]:
data[:3]

                   A         B         C         D  E
2021-01-01 -0.005078  1.455872  2.031893  0.296660  0
2021-01-02  1.301898  0.492462  2.432947  0.296697  1
2021-01-03  0.910164  0.941490 -1.714418 -0.140108  2

In [10]:
data[::-1]

                   A         B         C         D  E
2021-01-05  1.416276  0.786483 -1.611496  0.547112  4
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861  3
2021-01-03  0.910164  0.941490 -1.714418 -0.140108  2
2021-01-02  1.301898  0.492462  2.432947  0.296697  1
2021-01-01 -0.005078  1.455872  2.031893  0.296660  0

## Selection by label
---

In [11]:
# raise key error becasue index is not 0 or 1
# data.loc[0,1]

In [12]:
data.loc['2021-01-02':'2021-01-04']

                   A         B         C         D  E
2021-01-02  1.301898  0.492462  2.432947  0.296697  1
2021-01-03  0.910164  0.941490 -1.714418 -0.140108  2
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861  3

In [13]:
data.loc[['2021-01-02'],'B':]

                   B         C         D  E
2021-01-02  0.492462  2.432947  0.296697  1

In [14]:
data.loc[:,:]

                   A         B         C         D  E
2021-01-01 -0.005078  1.455872  2.031893  0.296660  0
2021-01-02  1.301898  0.492462  2.432947  0.296697  1
2021-01-03  0.910164  0.941490 -1.714418 -0.140108  2
2021-01-04 -1.006512 -1.637928 -1.643442  0.981861  3
2021-01-05  1.416276  0.786483 -1.611496  0.547112  4

## Selection by position
---

In [15]:
data = pd.DataFrame(np.random.randn(4,5), columns=list('ABCDE'))
data.iloc[:3] = 0
data

          A         B         C         D         E
0  0.000000  0.000000  0.000000  0.000000  0.000000
1  0.000000  0.000000  0.000000  0.000000  0.000000
2  0.000000  0.000000  0.000000  0.000000  0.000000
3  0.344122 -0.386431  1.381731  0.042576 -0.556676

## Selection by callable
---

In [16]:
data = pd.DataFrame(np.random.randn(4,5), columns=list('ABCDE'))
print(data)
data.loc[lambda df: df['A'] > 0, : ]

          A         B         C         D         E
0 -0.024722 -1.716838 -1.533949 -2.469834  1.026681
1  1.022702  1.095465  0.369476  0.113651  0.354260
2 -0.992270  0.319160 -0.721509  0.049399 -0.442835
3 -0.417429  1.199839 -1.876033 -0.179620  0.919543

          A         B         C         D        E
1  1.022702  1.095465  0.369476  0.113651  0.35426

In [17]:
data = pd.DataFrame(np.random.randn(4,5), columns=list('ABCDE'))
print(data)
data.loc[:, lambda df: ['A', 'B']]

          A         B         C         D         E
0  0.013500  0.526040 -1.324897  1.618338  0.791869
1  0.773037 -0.869185 -0.122268  0.622473  1.137531
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995

          A         B
0  0.013500  0.526040
1  0.773037 -0.869185
2 -1.939631  1.182001
3 -0.809266  0.045441

## Combining positional and label-based indexing
---

In [18]:
data.loc[data.index[[1,2]], ['A','B']]

          A         B
1  0.773037 -0.869185
2 -1.939631  1.182001

In [19]:
data.iloc[[1,2], data.columns.get_loc('A')]

1    0.773037
2   -1.939631
Name: A, dtype: float64

In [20]:
data.iloc[[1,2], data.columns.get_indexer(['A', 'B'])]

          A         B
1  0.773037 -0.869185
2 -1.939631  1.182001

## Selecting random samples
---

In [21]:
data.sample(n=3)

          A         B         C         D         E
1  0.773037 -0.869185 -0.122268  0.622473  1.137531
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470
0  0.013500  0.526040 -1.324897  1.618338  0.791869

## Setting with enlargement
---

In [22]:
# enlarge
print(data)
data.loc[:, 'F'] = data.loc[:, 'A']
data

          A         B         C         D         E
0  0.013500  0.526040 -1.324897  1.618338  0.791869
1  0.773037 -0.869185 -0.122268  0.622473  1.137531
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995

          A         B         C         D         E         F
0  0.013500  0.526040 -1.324897  1.618338  0.791869  0.013500
1  0.773037 -0.869185 -0.122268  0.622473  1.137531  0.773037
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470 -1.939631
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995 -0.809266

In [23]:
# append
data.loc[4] = 5
data

          A         B         C         D         E         F
0  0.013500  0.526040 -1.324897  1.618338  0.791869  0.013500
1  0.773037 -0.869185 -0.122268  0.622473  1.137531  0.773037
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470 -1.939631
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995 -0.809266
4  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000

## Fast scalar value getting and setting
---

In [24]:
data.iat[0,3]

1.6183383737339625

In [25]:
data.at[data.index[3], 'F']

-0.8092655023598346

## Boolean indexing
---

In [26]:
data[data['A']  > 3]

     A    B    C    D    E    F
4  5.0  5.0  5.0  5.0  5.0  5.0

In [27]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
   .....:                     'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
   .....:                     'c': np.random.randn(7)})
print(df2)
creterion = df2['a'].map(lambda x : x.startswith('t'))
df2[creterion]

       a  b         c
0    one  x  0.250011
1    one  y  0.327227
2    two  y -0.566087
3  three  x  0.283542
4    two  y  0.424955
5    one  x -0.327349
6    six  x -0.146288

       a  b         c
2    two  y -0.566087
3  three  x  0.283542
4    two  y  0.424955

In [28]:
# Multiple criteria
df2[creterion & (df2['c'] < 0)]

     a  b         c
2  two  y -0.566087

In [29]:
df2.loc[creterion & (df2['c'] <0), 'b':'c']

   b         c
2  y -0.566087

## Indexing with isin
---

In [30]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [31]:
s.isin([2,4,6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [32]:
s[s.isin([2,4,6])]

2    2
0    4
dtype: int64

In [33]:
 s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

## The where() Method and Masking
---

In [34]:
# only return matching data
s[s>0]

3    1
2    2
1    3
0    4
dtype: int64

In [35]:
# return matching data with same shape
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [36]:

dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df[df < 0]

                   A         B         C         D
2000-01-01       NaN -0.628325       NaN       NaN
2000-01-02       NaN       NaN       NaN -1.894285
2000-01-03 -1.268790       NaN       NaN -0.066300
2000-01-04 -2.039448 -0.797692 -1.563714       NaN
2000-01-05 -0.743510       NaN -0.137318       NaN
2000-01-06       NaN -0.848551 -0.329581       NaN
2000-01-07 -0.606288       NaN       NaN -0.427713
2000-01-08       NaN       NaN -0.142207       NaN

In [37]:
# where takes an optional other argument for replacement of values where the condition is False, in the returned copy.
df.where(df <0, -df)

                   A         B         C         D
2000-01-01 -0.105778 -0.628325 -1.134892 -0.346022
2000-01-02 -1.039662 -1.080522 -0.304642 -1.894285
2000-01-03 -1.268790 -0.835747 -0.623258 -0.066300
2000-01-04 -2.039448 -0.797692 -1.563714 -0.873871
2000-01-05 -0.743510 -0.449750 -0.137318 -0.379169
2000-01-06 -0.221371 -0.848551 -0.329581 -0.414932
2000-01-07 -0.606288 -0.506142 -0.848218 -0.427713
2000-01-08 -0.262168 -0.320995 -0.142207 -0.687357

In [38]:
df[df < 0] = 0
df

                   A         B         C         D
2000-01-01  0.105778  0.000000  1.134892  0.346022
2000-01-02  1.039662  1.080522  0.304642  0.000000
2000-01-03  0.000000  0.835747  0.623258  0.000000
2000-01-04  0.000000  0.000000  0.000000  0.873871
2000-01-05  0.000000  0.449750  0.000000  0.379169
2000-01-06  0.221371  0.000000  0.000000  0.414932
2000-01-07  0.000000  0.506142  0.848218  0.000000
2000-01-08  0.262168  0.320995  0.000000  0.687357

In [39]:
df3 = pd.DataFrame({'A': [1, 2, 3],
   .....:                     'B': [4, 5, 6],
   .....:                     'C': [7, 8, 9]})
df3.where(lambda x : x>4, lambda x: 'less than 4')

             A            B  C
0  less than 4  less than 4  7
1  less than 4            5  8
2  less than 4            6  9

## Mask
---

In [40]:
# mask() is the inverse boolean operation of where.
df3 = pd.DataFrame({'A': [1, 2, 3],
                        'B': [4, 5, 6],
                        'C': [7, 8, 9]})
df3.mask(lambda x : x>4, lambda x: 'more than 4')

   A            B            C
0  1            4  more than 4
1  2  more than 4  more than 4
2  3  more than 4  more than 4

## Setting with enlargement conditionally using numpy()
---

In [41]:
df = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})
df['color'] = np.where(df['col2'] == 'Z', 'green', 'red')
df

  col1 col2  color
0    A    Z  green
1    B    Z  green
2    B    X    red
3    C    Y    red

In [42]:
# multiple conditions
conditions = [
            (df['col2'] == 'Z') & (df['col1'] == 'A'),
            (df['col2'] == 'Z') & (df['col1'] == 'B'),
            (df['col1'] == 'B')
            ]
choices =  ['yellow', 'blue', 'purple']
df['color'] = np.select(conditions, choices, default='black')
df

  col1 col2   color
0    A    Z  yellow
1    B    Z    blue
2    B    X  purple
3    C    Y   black

## The query() Method
---

In [43]:
df = pd.DataFrame(np.random.rand(10, 3), columns=list('abc'))
df

          a         b         c
0  0.089730  0.428358  0.664502
1  0.572668  0.465274  0.895295
2  0.142390  0.284237  0.309357
3  0.605672  0.068117  0.902525
4  0.897366  0.389412  0.731035
5  0.679709  0.572401  0.432106
6  0.735978  0.135670  0.361199
7  0.299356  0.940739  0.510604
8  0.786168  0.530550  0.484186
9  0.529488  0.544867  0.319923

In [44]:
# filer data if a < b < c (python)
df[(df['a'] < df['b']) & (df['b'] < df['c']) ]

         a         b         c
0  0.08973  0.428358  0.664502
2  0.14239  0.284237  0.309357

In [45]:
# filer data if a < b < c (df.query())
df.query('(a < b) & (b < c)')

         a         b         c
0  0.08973  0.428358  0.664502
2  0.14239  0.284237  0.309357

In [46]:
# use index
df.query('index > 4')

          a         b         c
5  0.679709  0.572401  0.432106
6  0.735978  0.135670  0.361199
7  0.299356  0.940739  0.510604
8  0.786168  0.530550  0.484186
9  0.529488  0.544867  0.319923

## MultiIndex query() Syntax
---

In [47]:
colors = np.random.choice(['red', 'green'], size=10)
foods = np.random.choice(['egg', 'ham'], size=10)
index = pd.MultiIndex.from_arrays([colors, foods], names=['color', 'food'])

df = pd.DataFrame(np.random.randn(10, 2), index=index)
df

                   0         1
color food
red   ham   1.531289 -1.583913
      egg  -0.204333 -0.444000
green ham  -0.126850 -1.292981
      egg  -0.315548  2.331527
      ham   0.368954 -0.297517
      ham  -0.038386  2.125523
      egg   2.200507  1.468238
red   egg  -1.437275 -1.755126
      ham  -0.277766  0.360286
      ham   0.006808  0.357477

In [48]:
df.query('color == "red"')

                   0         1
color food
red   ham   1.531289 -1.583913
      egg  -0.204333 -0.444000
      egg  -1.437275 -1.755126
      ham  -0.277766  0.360286
      ham   0.006808  0.357477

In [49]:
df.index.names = [None, None]
df.query('ilevel_0 == "red"')

                0         1
red ham  1.531289 -1.583913
    egg -0.204333 -0.444000
    egg -1.437275 -1.755126
    ham -0.277766  0.360286
    ham  0.006808  0.357477

## query() Python versus pandas Syntax Comparison
---

In [50]:
df = pd.DataFrame(np.random.randint(10, size=(10, 3)), columns=list('abc'))

df.query('a < b & b > 0')

   a  b  c
0  2  8  4
1  4  9  7
3  5  6  7
4  0  4  2
6  0  1  9
7  0  8  5
8  6  7  1

In [51]:
df.query('a < b and b > 0')

   a  b  c
0  2  8  4
1  4  9  7
3  5  6  7
4  0  4  2
6  0  1  9
7  0  8  5
8  6  7  1

In [52]:
df.query('a < b < 10')

   a  b  c
0  2  8  4
1  4  9  7
3  5  6  7
4  0  4  2
6  0  1  9
7  0  8  5
8  6  7  1

In [53]:
df.query('a in b')

   a  b  c
0  2  8  4
1  4  9  7
2  6  0  4
4  0  4  2
5  9  2  5
6  0  1  9
7  0  8  5
8  6  7  1
9  4  4  3

## Boolean operators
---

In [54]:
df = pd.DataFrame(np.random.rand(10, 3), columns=list('abc'))
df

          a         b         c
0  0.027027  0.897778  0.304012
1  0.021964  0.593208  0.912012
2  0.084704  0.779928  0.420327
3  0.085527  0.319723  0.722441
4  0.406820  0.721579  0.228431
5  0.886585  0.458626  0.903384
6  0.726150  0.911048  0.924308
7  0.585773  0.741427  0.619552
8  0.070661  0.658513  0.629258
9  0.252968  0.733521  0.867816

In [55]:
df['bools'] = np.random.rand(len(df)) > 0.5
df

          a         b         c  bools
0  0.027027  0.897778  0.304012  False
1  0.021964  0.593208  0.912012  False
2  0.084704  0.779928  0.420327   True
3  0.085527  0.319723  0.722441  False
4  0.406820  0.721579  0.228431  False
5  0.886585  0.458626  0.903384   True
6  0.726150  0.911048  0.924308  False
7  0.585773  0.741427  0.619552  False
8  0.070661  0.658513  0.629258  False
9  0.252968  0.733521  0.867816   True

In [56]:
df.query('~bools')

          a         b         c  bools
0  0.027027  0.897778  0.304012  False
1  0.021964  0.593208  0.912012  False
3  0.085527  0.319723  0.722441  False
4  0.406820  0.721579  0.228431  False
6  0.726150  0.911048  0.924308  False
7  0.585773  0.741427  0.619552  False
8  0.070661  0.658513  0.629258  False

In [57]:
 df.query('not bools')

          a         b         c  bools
0  0.027027  0.897778  0.304012  False
1  0.021964  0.593208  0.912012  False
3  0.085527  0.319723  0.722441  False
4  0.406820  0.721579  0.228431  False
6  0.726150  0.911048  0.924308  False
7  0.585773  0.741427  0.619552  False
8  0.070661  0.658513  0.629258  False

## Duplicate data
---

In [58]:
 df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
'c': np.random.randn(7)})
df2

       a  b         c
0    one  x  0.609739
1    one  y  0.418041
2    two  x -0.515477
3    two  y  0.773079
4    two  x -0.491846
5  three  x -1.215375
6   four  x -0.549582

In [59]:
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [60]:
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [61]:
df2.drop_duplicates('a', keep='last')

       a  b         c
1    one  y  0.418041
4    two  x -0.491846
5  three  x -1.215375
6   four  x -0.549582

## Dictionary-like get() method
---

In [62]:
s = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
# same to s['b']
s.get('b')

2

In [63]:
s.get('x', default=-1)

-1

## Looking up values by index/column labels
---

In [64]:
df = pd.DataFrame({'col': ["A", "A", "B", "B"],
                   'A': [80, 23, np.nan, 22],
                   'B': [80, 55, 76, 67]})
df

  col     A   B
0   A  80.0  80
1   A  23.0  55
2   B   NaN  76
3   B  22.0  67

In [66]:
melt = df.melt('col')
melt

  col variable  value
0   A        A   80.0
1   A        A   23.0
2   B        A    NaN
3   B        A   22.0
4   A        B   80.0
5   A        B   55.0
6   B        B   76.0
7   B        B   67.0

## Index objects
---

In [69]:
index = pd.Index(['a', 'b','c', 'd'])
'e' in index

False

In [72]:
index.name = 'something'
index

Index(['a', 'b', 'c', 'd'], dtype='object', name='something')

In [79]:
df = pd.DataFrame(np.random.randint(4, size=[4, 3]), index=index)
df[0]

something
a    3
b    1
c    3
d    2
Name: 0, dtype: int32

In [86]:
index.set_names('that', inplace=True)
df = pd.DataFrame(np.random.randint(4, size=[4, 3]), index=index)
index

Index(['a', 'b', 'c', 'd'], dtype='object', name='that')

## Set operations on Index objects
---

In [89]:
a = pd.Index(['c', 'b', 'a'])
b = pd.Index(['c', 'e', 'd'])
a.union(b)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

## Missing values
---

In [91]:
idx1 = pd.Index([1, np.nan, 3, 4])
idx1.fillna(2)

Float64Index([1.0, 2.0, 3.0, 4.0], dtype='float64')

In [93]:
idx2 = pd.DatetimeIndex([pd.Timestamp('2011-01-01'),
                        pd.NaT,
                       pd.Timestamp('2011-01-03')])
idx2.fillna(pd.Timestamp('20000101'))

DatetimeIndex(['2011-01-01', '2000-01-01', '2011-01-03'], dtype='datetime64[ns]', freq=None)

## Set / reset index
---

In [95]:
data

          A         B         C         D         E         F
0  0.013500  0.526040 -1.324897  1.618338  0.791869  0.013500
1  0.773037 -0.869185 -0.122268  0.622473  1.137531  0.773037
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470 -1.939631
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995 -0.809266
4  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000

In [97]:
data.set_index('C')

                  A         B         D         E         F
C
-1.324897  0.013500  0.526040  1.618338  0.791869  0.013500
-0.122268  0.773037 -0.869185  0.622473  1.137531  0.773037
-1.565504 -1.939631  1.182001 -0.519593  0.760470 -1.939631
 0.634580 -0.809266  0.045441 -0.479556 -1.147995 -0.809266
 5.000000  5.000000  5.000000  5.000000  5.000000  5.000000

In [100]:
data.set_index(['C', 'A'])

                            B         D         E         F
C         A
-1.324897  0.013500  0.526040  1.618338  0.791869  0.013500
-0.122268  0.773037 -0.869185  0.622473  1.137531  0.773037
-1.565504 -1.939631  1.182001 -0.519593  0.760470 -1.939631
 0.634580 -0.809266  0.045441 -0.479556 -1.147995 -0.809266
 5.000000  5.000000  5.000000  5.000000  5.000000  5.000000

In [102]:
data.reset_index()
data

          A         B         C         D         E         F
0  0.013500  0.526040 -1.324897  1.618338  0.791869  0.013500
1  0.773037 -0.869185 -0.122268  0.622473  1.137531  0.773037
2 -1.939631  1.182001 -1.565504 -0.519593  0.760470 -1.939631
3 -0.809266  0.045441  0.634580 -0.479556 -1.147995 -0.809266
4  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000